raddanesh/ClockClock-24/firmware/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v12.0
processor: LPC845
package_id: LPC845M301JBD48
mcu_data: ksdk2_0
processor_version: 12.0.0
board: LPC845BREAKOUT
pin_labels:
- {pin_num: '14', pin_signal: PIO1_1/CAPT_X2, label: RS485_TXRX_EN, identifier: LED_BLUE;RS485_TXRX_EN}
- {pin_num: '2', pin_signal: PIO0_13/ADC_10, label: M8_STEP, identifier: M8_STEP}
- {pin_num: '4', pin_signal: PIO0_12, label: M8_DIR, identifier: M8_DIR}
- {pin_num: '6', pin_signal: PIO0_4/ADC_11, label: M11_DIR, identifier: K3;M8_DIR;M11_DIR}
- {pin_num: '7', pin_signal: PIO0_28/WKTCLKIN, label: M6_DIR, identifier: M3_DIR;M3_DIR_;M6_DIR}
- {pin_num: '9', pin_signal: PIO0_31/CAPT_X0, label: M7_STEP, identifier: CAPX;M7_STEP}
- {pin_num: '12', pin_signal: PIO0_11/I2C0_SDA, label: M7_STEP, identifier: M7_STEP}
- {pin_num: '13', pin_signal: PIO0_10/I2C0_SCL, label: M7_DIR, identifier: MM;RS;M7_STEP;M7_DIR}
- {pin_num: '15', pin_signal: PIO0_16, label: M0_DIR, identifier: M0_DIR}
- {pin_num: '17', pin_signal: PIO0_27, label: M5_STEP, identifier: M2_STEP;M2_STEP_;M5_STEP}
- {pin_num: '18', pin_signal: PIO0_26, label: M5_DIR, identifier: M2_DIR;M2_DIR_;M5_DIR}
- {pin_num: '19', pin_signal: PIO0_25, label: M11_STEP, identifier: DEBUG_UART_TX;M4_STEP}
- {pin_num: '20', pin_signal: PIO0_24, label: M4_DIR, identifier: DEBUG_UART_RX;M4_DIR}
- {pin_num: '22', pin_signal: PIO0_15, label: M9_STEP, identifier: M9_STEP}
- {pin_num: '24', pin_signal: PIO0_1/ACMP_I2/CLKIN, label: M11_STEP, identifier: RS485_TXRX_EN;Hall_M1;M11_STEP}
- {pin_num: '25', pin_signal: PIO0_9/XTALOUT, label: MAG1, identifier: M7_DIR;MAG1}
- {pin_num: '26', pin_signal: PIO0_8/XTALIN, label: MAG0, identifier: RESET;MAG2;MAG0}
- {pin_num: '33', pin_signal: PIO0_7/ADC_0, label: M10_DIR, identifier: M9_DIR;M10_DIR}
- {pin_num: '34', pin_signal: PIO0_6/ADC_1/ACMPVREF, label: M10_STEP, identifier: M8_STEP;M10_STEP}
- {pin_num: '36', pin_signal: PIO0_0/ACMP_I1, label: DRV_RESET, identifier: Hall_M0;DRV_RESET}
- {pin_num: '37', pin_signal: PIO0_14/ACMP_I3/ADC_2, label: M9_DIR, identifier: M9_DIR}
- {pin_num: '38', pin_signal: PIO0_29/DACOUT_1, label: M6_STEP, identifier: M3_STEP;M3_STEP_;M6_STEP}
- {pin_num: '39', pin_signal: PIO0_23/ADC_3/ACMP_I4, label: M3_STEP, identifier: M3_STEP}
- {pin_num: '42', pin_signal: PIO0_30/ACMP_I5, label: M7_DIR, identifier: CAPY_R;M7_DIR}
- {pin_num: '43', pin_signal: PIO0_22/ADC_4, label: M3_DIR, identifier: Hall_M1;M3_DIR}
- {pin_num: '44', pin_signal: PIO0_21/ADC_5, label: M2_STEP, identifier: Hall_M0;M2_STEP}
- {pin_num: '45', pin_signal: PIO0_20/ADC_6, label: M2_DIR, identifier: RESET;M2_DIR}
- {pin_num: '46', pin_signal: PIO0_19/ADC_7, label: M1_STEP, identifier: M1_STEP}
- {pin_num: '47', pin_signal: PIO0_18/ADC_8, label: M1_DIR, identifier: M1_DIR}
- {pin_num: '48', pin_signal: PIO0_17/ADC_9/DACOUT_0, label: M0_STEP, identifier: M0_STEP}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_swm.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitMotorPins();
    BOARD_InitMagPins();
    BOARD_InitRS485();
    BOARD_InitSWD_DEBUGPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitMotorPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '15', peripheral: GPIO, signal: 'PIO0, 16', pin_signal: PIO0_16, direction: OUTPUT}
  - {pin_num: '48', peripheral: GPIO, signal: 'PIO0, 17', pin_signal: PIO0_17/ADC_9/DACOUT_0, direction: OUTPUT}
  - {pin_num: '47', peripheral: GPIO, signal: 'PIO0, 18', pin_signal: PIO0_18/ADC_8, direction: OUTPUT}
  - {pin_num: '46', peripheral: GPIO, signal: 'PIO0, 19', pin_signal: PIO0_19/ADC_7, direction: OUTPUT}
  - {pin_num: '45', peripheral: GPIO, signal: 'PIO0, 20', pin_signal: PIO0_20/ADC_6, identifier: M2_DIR, direction: OUTPUT}
  - {pin_num: '44', peripheral: GPIO, signal: 'PIO0, 21', pin_signal: PIO0_21/ADC_5, identifier: M2_STEP, direction: OUTPUT}
  - {pin_num: '43', peripheral: GPIO, signal: 'PIO0, 22', pin_signal: PIO0_22/ADC_4, identifier: M3_DIR, direction: OUTPUT}
  - {pin_num: '39', peripheral: GPIO, signal: 'PIO0, 23', pin_signal: PIO0_23/ADC_3/ACMP_I4, direction: OUTPUT}
  - {pin_num: '20', peripheral: GPIO, signal: 'PIO0, 24', pin_signal: PIO0_24, identifier: M4_DIR, direction: OUTPUT}
  - {pin_num: '19', peripheral: GPIO, signal: 'PIO0, 25', pin_signal: PIO0_25, identifier: M4_STEP, direction: OUTPUT}
  - {pin_num: '18', peripheral: GPIO, signal: 'PIO0, 26', pin_signal: PIO0_26, identifier: M5_DIR, direction: OUTPUT}
  - {pin_num: '17', peripheral: GPIO, signal: 'PIO0, 27', pin_signal: PIO0_27, identifier: M5_STEP, direction: OUTPUT}
  - {pin_num: '7', peripheral: GPIO, signal: 'PIO0, 28', pin_signal: PIO0_28/WKTCLKIN, identifier: M6_DIR, direction: OUTPUT}
  - {pin_num: '38', peripheral: GPIO, signal: 'PIO0, 29', pin_signal: PIO0_29/DACOUT_1, identifier: M6_STEP, direction: OUTPUT}
  - {pin_num: '13', peripheral: GPIO, signal: 'PIO0, 10', pin_signal: PIO0_10/I2C0_SCL, identifier: M7_DIR, direction: OUTPUT, i2cmode: gpioMode}
  - {pin_num: '6', peripheral: GPIO, signal: 'PIO0, 4', pin_signal: PIO0_4/ADC_11, identifier: M11_DIR, direction: OUTPUT}
  - {pin_num: '34', peripheral: GPIO, signal: 'PIO0, 6', pin_signal: PIO0_6/ADC_1/ACMPVREF, identifier: M10_STEP, direction: OUTPUT}
  - {pin_num: '33', peripheral: GPIO, signal: 'PIO0, 7', pin_signal: PIO0_7/ADC_0, identifier: M10_DIR, direction: OUTPUT}
  - {pin_num: '22', peripheral: GPIO, signal: 'PIO0, 15', pin_signal: PIO0_15, direction: OUTPUT}
  - {pin_num: '37', peripheral: GPIO, signal: 'PIO0, 14', pin_signal: PIO0_14/ACMP_I3/ADC_2, direction: OUTPUT}
  - {pin_num: '2', peripheral: GPIO, signal: 'PIO0, 13', pin_signal: PIO0_13/ADC_10, direction: OUTPUT}
  - {pin_num: '4', peripheral: GPIO, signal: 'PIO0, 12', pin_signal: PIO0_12, direction: OUTPUT}
  - {pin_num: '12', peripheral: GPIO, signal: 'PIO0, 11', pin_signal: PIO0_11/I2C0_SDA, direction: OUTPUT, i2cmode: gpioMode}
  - {pin_num: '24', peripheral: GPIO, signal: 'PIO0, 1', pin_signal: PIO0_1/ACMP_I2/CLKIN, identifier: M11_STEP, direction: OUTPUT}
  - {pin_num: '36', peripheral: GPIO, signal: 'PIO0, 0', pin_signal: PIO0_0/ACMP_I1, identifier: DRV_RESET, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

