raddanesh/ClockClock-24/firmware/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitMotorPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitMotorPins(void)
{
    /* Enables clock for IOCON.: enable */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    gpio_pin_config_t gpio0_pin0_0 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_0 (pin )  */
    GPIO_PinInit(GPIO, 0U, 0U, &gpio0_pin0_0);

    gpio_pin_config_t gpio0_pin0_1 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_1 (pin )  */
    GPIO_PinInit(GPIO, 0U, 1U, &gpio0_pin0_1);

    gpio_pin_config_t gpio0_pin0_4 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_4 (pin )  */
    GPIO_PinInit(GPIO, 0U, 4U, &gpio0_pin0_4);

    gpio_pin_config_t gpio0_pin0_6 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_6 (pin )  */
    GPIO_PinInit(GPIO, 0U, 6U, &gpio0_pin0_6);

    gpio_pin_config_t gpio0_pin0_7 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_7 (pin )  */
    GPIO_PinInit(GPIO, 0U, 7U, &gpio0_pin0_7);

    gpio_pin_config_t M7_DIR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_10 (pin 13)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M7_DIR_GPIO, BOARD_INITMOTORPINS_M7_DIR_PORT, BOARD_INITMOTORPINS_M7_DIR_PIN, &M7_DIR_config);

    gpio_pin_config_t M7_STEP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_11 (pin 12)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M7_STEP_GPIO, BOARD_INITMOTORPINS_M7_STEP_PORT, BOARD_INITMOTORPINS_M7_STEP_PIN, &M7_STEP_config);

    gpio_pin_config_t gpio0_pin0_12 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_12 (pin )  */
    GPIO_PinInit(GPIO, 0U, 12U, &gpio0_pin0_12);

    gpio_pin_config_t gpio0_pin0_13 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_13 (pin )  */
    GPIO_PinInit(GPIO, 0U, 13U, &gpio0_pin0_13);

    gpio_pin_config_t gpio0_pin0_14 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_14 (pin )  */
    GPIO_PinInit(GPIO, 0U, 14U, &gpio0_pin0_14);

    gpio_pin_config_t gpio0_pin0_15 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_15 (pin )  */
    GPIO_PinInit(GPIO, 0U, 15U, &gpio0_pin0_15);

    gpio_pin_config_t M0_DIR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_16 (pin 15)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M0_DIR_GPIO, BOARD_INITMOTORPINS_M0_DIR_PORT, BOARD_INITMOTORPINS_M0_DIR_PIN, &M0_DIR_config);

    gpio_pin_config_t M0_STEP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_17 (pin 48)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M0_STEP_GPIO, BOARD_INITMOTORPINS_M0_STEP_PORT, BOARD_INITMOTORPINS_M0_STEP_PIN, &M0_STEP_config);

    gpio_pin_config_t M1_DIR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_18 (pin 47)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M1_DIR_GPIO, BOARD_INITMOTORPINS_M1_DIR_PORT, BOARD_INITMOTORPINS_M1_DIR_PIN, &M1_DIR_config);

    gpio_pin_config_t M1_STEP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_19 (pin 46)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M1_STEP_GPIO, BOARD_INITMOTORPINS_M1_STEP_PORT, BOARD_INITMOTORPINS_M1_STEP_PIN, &M1_STEP_config);

    gpio_pin_config_t M2_DIR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_20 (pin 45)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M2_DIR_GPIO, BOARD_INITMOTORPINS_M2_DIR_PORT, BOARD_INITMOTORPINS_M2_DIR_PIN, &M2_DIR_config);

    gpio_pin_config_t M2_STEP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_21 (pin 44)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M2_STEP_GPIO, BOARD_INITMOTORPINS_M2_STEP_PORT, BOARD_INITMOTORPINS_M2_STEP_PIN, &M2_STEP_config);

    gpio_pin_config_t M3_DIR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_22 (pin 43)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M3_DIR_GPIO, BOARD_INITMOTORPINS_M3_DIR_PORT, BOARD_INITMOTORPINS_M3_DIR_PIN, &M3_DIR_config);

    gpio_pin_config_t M3_STEP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_23 (pin 39)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M3_STEP_GPIO, BOARD_INITMOTORPINS_M3_STEP_PORT, BOARD_INITMOTORPINS_M3_STEP_PIN, &M3_STEP_config);

    gpio_pin_config_t M4_DIR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_24 (pin 20)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M4_DIR_GPIO, BOARD_INITMOTORPINS_M4_DIR_PORT, BOARD_INITMOTORPINS_M4_DIR_PIN, &M4_DIR_config);

    gpio_pin_config_t M4_STEP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_25 (pin 19)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M4_STEP_GPIO, BOARD_INITMOTORPINS_M4_STEP_PORT, BOARD_INITMOTORPINS_M4_STEP_PIN, &M4_STEP_config);

