raddanesh/ClockClock-24/firmware/board/pin_mux.c
    gpio_pin_config_t gpio0_pin0_26 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_26 (pin )  */
    GPIO_PinInit(GPIO, 0U, 26U, &gpio0_pin0_26);

    gpio_pin_config_t gpio0_pin0_27 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_27 (pin )  */
    GPIO_PinInit(GPIO, 0U, 27U, &gpio0_pin0_27);

    gpio_pin_config_t gpio0_pin0_28 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_28 (pin )  */
    GPIO_PinInit(GPIO, 0U, 28U, &gpio0_pin0_28);

    gpio_pin_config_t gpio0_pin0_29 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_29 (pin )  */
    GPIO_PinInit(GPIO, 0U, 29U, &gpio0_pin0_29);

    IOCON->PIO[8] = ((IOCON->PIO[8] &
                      /* Mask bits to zero which are setting */
                      (~(IOCON_PIO_I2CMODE_MASK)))

                     /* Selects I2C mode.: Standard GPIO functionality. Requires external pull-up for GPIO output
                      * function. */
                     | IOCON_PIO_I2CMODE(PIO0_10_I2CMODE_Standard_GPIO));

    IOCON->PIO[7] = ((IOCON->PIO[7] &
                      /* Mask bits to zero which are setting */
                      (~(IOCON_PIO_I2CMODE_MASK)))

                     /* Selects I2C mode.: Standard GPIO functionality. Requires external pull-up for GPIO output
                      * function. */
                     | IOCON_PIO_I2CMODE(PIO0_11_I2CMODE_Standard_GPIO));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitMagPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '25', peripheral: GPIO, signal: 'PIO0, 9', pin_signal: PIO0_9/XTALOUT, identifier: MAG1, direction: INPUT}
  - {pin_num: '26', peripheral: GPIO, signal: 'PIO0, 8', pin_signal: PIO0_8/XTALIN, identifier: MAG0, direction: INPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitMagPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitMagPins(void)
{
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    gpio_pin_config_t MAG0_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_8 (pin 26)  */
    GPIO_PinInit(BOARD_INITMAGPINS_MAG0_GPIO, BOARD_INITMAGPINS_MAG0_PORT, BOARD_INITMAGPINS_MAG0_PIN, &MAG0_config);

    gpio_pin_config_t MAG1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_9 (pin 25)  */
    GPIO_PinInit(BOARD_INITMAGPINS_MAG1_GPIO, BOARD_INITMAGPINS_MAG1_PORT, BOARD_INITMAGPINS_MAG1_PIN, &MAG1_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitRS485:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '14', peripheral: USART2, signal: RTS, pin_signal: PIO1_1/CAPT_X2, identifier: RS485_TXRX_EN}
  - {pin_num: '16', peripheral: USART2, signal: TXD, pin_signal: PIO1_2/CAPT_X3, identifier: ''}
  - {pin_num: '11', peripheral: USART2, signal: RXD, pin_signal: PIO1_0/CAPT_X1, identifier: ''}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitRS485
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitRS485(void)
{
    /* Enables clock for switch matrix.: enable */
    CLOCK_EnableClock(kCLOCK_Swm);

    /* USART2_TXD connect to P1_2 */
    SWM_SetMovablePinSelect(SWM0, kSWM_USART2_TXD, kSWM_PortPin_P1_2);

    /* USART2_RXD connect to P1_0 */
    SWM_SetMovablePinSelect(SWM0, kSWM_USART2_RXD, kSWM_PortPin_P1_0);

    /* USART2_RTS connect to P1_1 */
    SWM_SetMovablePinSelect(SWM0, kSWM_USART2_RTS, kSWM_PortPin_P1_1);

    /* Disable clock for switch matrix. */
    CLOCK_DisableClock(kCLOCK_Swm);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSWD_DEBUGPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '8', peripheral: SWD, signal: SWCLK, pin_signal: SWCLK/PIO0_3}
  - {pin_num: '10', peripheral: SWD, signal: SWDIO, pin_signal: SWDIO/PIO0_2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSWD_DEBUGPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitSWD_DEBUGPins(void)
{
    /* Enables clock for switch matrix.: enable */
    CLOCK_EnableClock(kCLOCK_Swm);

    /* SWCLK connect to P0_3 */
    SWM_SetFixedPinSelect(SWM0, kSWM_SWCLK, true);

    /* SWDIO connect to P0_2 */
    SWM_SetFixedPinSelect(SWM0, kSWM_SWDIO, true);

    /* Disable clock for switch matrix. */
    CLOCK_DisableClock(kCLOCK_Swm);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
